# Importing Data

In [5]:
import pandas as pd
data = pd.read_csv('../../Downloads/hp_data.csv')
data.head()

,Unnamed: 0,price,place,built,sqft,sale,yearsOld,floor,totalFloor,bhk
0,1341,6300000,BTM Layout,Super built-up Area,1450,Resale,5,1,4,1
1,2126,11500000,Yelahanka,Super built-up Area,2190,Resale,5,3,5,3
2,816,3800000,Whitefield,Super built-up Area,1019,Resale,1,2,5,2
3,2708,10500000,Ambalipura,Super built-up Area,1857,Resale,15,4,5,4
4,1041,11500000,Yelahanka,Super built-up Area,2190,Resale,5,3,5,3

# Data Preparation

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3500 entries, 0 to 3499
Data columns (total 10 columns):
Unnamed: 0    3500 non-null int64
price         3500 non-null int64
place         3500 non-null object
built         3500 non-null object
sqft          3500 non-null int64
sale          3500 non-null object
yearsOld      3500 non-null int64
floor         3500 non-null int64
totalFloor    3500 non-null int64
bhk           3500 non-null int64
dtypes: int64(7), object(3)
memory usage: 273.6+ KB

In [7]:
data.isnull().sum()

Unnamed: 0    0
price         0
place         0
built         0
sqft          0
sale          0
yearsOld      0
floor         0
totalFloor    0
bhk           0
dtype: int64

In [8]:
data.head()

,Unnamed: 0,price,place,built,sqft,sale,yearsOld,floor,totalFloor,bhk
0,1341,6300000,BTM Layout,Super built-up Area,1450,Resale,5,1,4,1
1,2126,11500000,Yelahanka,Super built-up Area,2190,Resale,5,3,5,3
2,816,3800000,Whitefield,Super built-up Area,1019,Resale,1,2,5,2
3,2708,10500000,Ambalipura,Super built-up Area,1857,Resale,15,4,5,4
4,1041,11500000,Yelahanka,Super built-up Area,2190,Resale,5,3,5,3

In [9]:
data.drop('Unnamed: 0',axis=1,inplace=True)

In [10]:
from collections import Counter
Counter(data.place)

Counter({'BTM Layout': 356,
         'Yelahanka': 337,
         'Whitefield': 327,
         'Ambalipura': 340,
         'Devarabeesana Halli': 368,
         'Yelachenahalli': 321,
         'KR Puram': 358,
         'Electronics City Phase 1': 351,
         'Abbaiah Reddy Layout': 352,
         'Subramanyapura': 323,
         'Rajaji Nagar': 9,
         'Sarakki Nagar': 18,
         'Gunjur': 12,
         'Malleshwaram': 17,
         'Frazer Town': 11})

In [11]:
Counter(data.sale)

Counter({'Resale': 3500})

In [12]:
#data.drop('sale',axis=1,inplace=True)

In [13]:
Counter(data.built)

Counter({'Super built-up  Area': 3148, 'Built-up  Area': 352})

# Feature Engineering

In [14]:
data.head()

,price,place,built,sqft,sale,yearsOld,floor,totalFloor,bhk
0,6300000,BTM Layout,Super built-up Area,1450,Resale,5,1,4,1
1,11500000,Yelahanka,Super built-up Area,2190,Resale,5,3,5,3
2,3800000,Whitefield,Super built-up Area,1019,Resale,1,2,5,2
3,10500000,Ambalipura,Super built-up Area,1857,Resale,15,4,5,4
4,11500000,Yelahanka,Super built-up Area,2190,Resale,5,3,5,3

In [15]:
# Label encoding
from sklearn.preprocessing import LabelEncoder
enc_place = LabelEncoder()
enc_built = LabelEncoder()
data.place = enc_place.fit_transform(data.place)
data.built = enc_built.fit_transform(data.built)
data.head()

      price  place  built  sqft    sale  yearsOld  floor  totalFloor  bhk
0   6300000      2      1  1450  Resale         5      1           4    1
1  11500000     14      1  2190  Resale         5      3           5    3
2   3800000     12      1  1019  Resale         1      2           5    2
3  10500000      1      1  1857  Resale        15      4           5    4
4  11500000     14      1  2190  Resale         5      3           5    3

In [16]:
pd.DataFrame(enc_place.classes_)

                           0
0       Abbaiah Reddy Layout
1                 Ambalipura
2                 BTM Layout
3        Devarabeesana Halli
4   Electronics City Phase 1
5                Frazer Town
6                     Gunjur
7                   KR Puram
8               Malleshwaram
9               Rajaji Nagar
10             Sarakki Nagar
11            Subramanyapura
12                Whitefield
13            Yelachenahalli
14                 Yelahanka

In [17]:
# finding correlation of X with y. Selecting / Transforming Features
data.corr()

,price,place,built,sqft,yearsOld,floor,totalFloor,bhk
price,1.000000,0.017520,0.219235,0.778364,0.215712,0.263472,0.402256,0.263472
place,0.017520,1.000000,0.436348,0.105978,-0.573264,0.216312,0.199951,0.216312
built,0.219235,0.436348,1.000000,0.271690,-0.210871,0.223619,0.177752,0.223619
sqft,0.778364,0.105978,0.271690,1.000000,0.229461,0.356053,0.358946,0.356053
yearsOld,0.215712,-0.573264,-0.210871,0.229461,1.000000,-0.116427,-0.142562,-0.116427
floor,0.263472,0.216312,0.223619,0.356053,-0.116427,1.000000,0.958100,1.000000
totalFloor,0.402256,0.199951,0.177752,0.358946,-0.142562,0.958100,1.000000,0.958100
bhk,0.263472,0.216312,0.223619,0.356053,-0.116427,1.000000,0.958100,1.000000

In [18]:
X = data.loc[:,['sqft','yearsOld','totalFloor','place','bhk']]
y = data.price
X.head()

   sqft  yearsOld  totalFloor  place  bhk
0  1450         5           4      2    1
1  2190         5           5     14    3
2  1019         1           5     12    2
3  1857        15           5      1    4
4  2190         5           5     14    3

# Model spliting to Train  and Test

In [19]:
from sklearn.model_selection import train_test_split

In [20]:
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.3,random_state=10)
X_train.shape

(2450, 5)

In [21]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()
model.fit(X_train,y_train)
y_predict = model.predict(X_test)

In [22]:
from sklearn.metrics import r2_score  #  r2 =  1 -  SSR/SST
r2_score(y_test,y_predict)

0.8560640099843072

In [23]:
model.predict([[1500,5,10,5,3]])

array([16322313.67827753])

# Export the model

In [24]:
from sklearn.externals import joblib
joblib.dump(model,'hppredict25AUG.ml')

/home/skdie/anaconda3/envs/datamites/lib/python3.7/site-packages/sklearn/externals/joblib/__init__.py:15: DeprecationWarning: sklearn.externals.joblib is deprecated in 0.21 and will be removed in 0.23. Please import this functionality directly from joblib, which can be installed with: pip install joblib. If this warning is raised when loading pickled models, you may need to re-serialize those models with scikit-learn 0.21+.
  warnings.warn(msg, category=DeprecationWarning)

['hppredict25AUG.ml']

In [25]:
%pwd

'/home/skdie/handsOnMachineLearning/api'